app/views/movies/show.html.erb

  <h2>Comments</h2>
  <% @movie.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 1]]