app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = ?  [["title", "search"]]
SELECT "movies".* FROM "movies"  ORDER BY title, asc
---
	def index
	   if params[:search]
	     @movies = Movie.where("title LIKE ?", "%#{params[:search]}%")
<<<<<<< HEAD
	   else
	     @movies = Movie.order(params[:sort])

INSERT INTO "movies" ("title", "year", "runtime", "director", "description", "netflix", "hulu", "amazon", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@movie = Movie.new(movie_params)

		@movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars Episode V: The Empire Strikes Back"], ["updated_at", "2015-10-25 20:37:16.404965"], ["id", 1]]
---
	def update
		@movie = Movie.find(params[:id])

		if @movie.update(movie_params)